app/views/user_mailer/welcome_email.html.erb

<div style="width: 90%; margin:0 auto; text-align: center;">
  <h1 style="color: #6534ff"> <%= @pm.user.first_name %> has invited you to join RevCount</h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]