app/controllers/application_controller.rb

    def login
        if params.has_key?('client')
            client = Client.find_by(email: params[:client][:email])
            if client && client.authenticate(params[:client][:password])
                render json: { status: "success", user: client.email, user_type: 'client', token: issue_token({ id: client.id, user_type: 'client' })}, status: 200
            else
                render json: { error: "Incorrect password or username."}, status: 401
            end
        else
            project_manager = ProjectManager.find_by(email: params[:email])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."email" = $1 LIMIT $2  [["email", "johndoe@gmail.com"], ["LIMIT", 1]]
SELECT  "project_managers".* FROM "project_managers" WHERE "project_managers"."email" = $1 LIMIT $2  [["email", "matthew.97.clark@gmail.com"], ["LIMIT", 1]]

    def get_current_client
        id = decoded_token['id']
        Client.find_by(id: id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def get_current_project_manager
        id = decoded_token['id']
        ProjectManager.find_by(id: id)
---
SELECT  "project_managers".* FROM "project_managers" WHERE "project_managers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]