app/controllers/application_controller.rb

    def get_current_client
        id = decoded_token['id']
        Client.find_by(id: id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def get_current_project_manager
        id = decoded_token['id']
        ProjectManager.find_by(id: id)
---
SELECT  "project_managers".* FROM "project_managers" WHERE "project_managers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]