app/controllers/client_controller.rb

    def create
        begin
            client = Client.create(client_params)
---
INSERT INTO "clients" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def show
        client = Client.find_by(id: params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def login
        client = Client.find_by(email: client_params[:email])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."email" = $1 LIMIT $2  [["email", "testing@client.com"], ["LIMIT", 1]]