app/controllers/comment_controller.rb

SELECT  "revisions".* FROM "revisions" WHERE "revisions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."revision_id" = $1  [["revision_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("revision_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["revision_id", 3], ["user_id", 5], ["content", "test"], ["created_at", "2020-02-23 14:15:49.277972"], ["updated_at", "2020-02-23 14:15:49.277972"]]
---
    def index
        revision = Revision.find_by(id: params[:id])
        comments = []
        revision.comments.each do |comment|
           commentHash = { content: comment.content, user: comment.user.first_name }
           if comment.user.clients.length > 0
                commentHash[:user_type] = 'client'
           else
                commentHash[:user_type] = 'pm'
           end
           comments.push(commentHash)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "matthew.97.clark@gmail.com"], ["LIMIT", 1]]
INSERT INTO "comments" ("revision_id", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["revision_id", 3], ["user_id", 5], ["content", "test"], ["created_at", "2020-02-23 14:15:49.277972"], ["updated_at", "2020-02-23 14:15:49.277972"]]
---
    def create
        user = User.find_by(email: comment_params[:user])
        comment = Comment.create(content: comment_params[:content], revision_id: comment_params[:revision_id], user_id: user.id)