app/controllers/project_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "johndoe@gmail.com"], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."project_manager_id" = $1  [["project_manager_id", 2]]
SELECT  "project_managers".* FROM "project_managers" WHERE "project_managers"."user_id" = $1 ORDER BY "project_managers"."id" ASC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = $1 ORDER BY "clients"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "projects" ("name", "max_revisions", "project_manager_id", "client_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        client = User.find_by(email: project_params[:email])
        project_manager = get_current_user.project_managers.first
        project = Project.new(name: project_params[:name], max_revisions: project_params[:max_revisions])
        client = client.clients.first
        project[:client_id] = client.id
        project[:project_manager_id] = project_manager.id
        project[:status] = 'in progress'
        project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show
        project = Project.find_by(id: params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."project_manager_id" = $1  [["project_manager_id", 2]]
SELECT  "project_managers".* FROM "project_managers" WHERE "project_managers"."user_id" = $1 ORDER BY "project_managers"."id" ASC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
---
    def invite
        project_manager = get_current_user.project_managers.first