app/controllers/project_controller.rb

    def show
        project = Project.find_by(id: params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]