app/controllers/project_manager_controller.rb

    def create
        begin
            project_manager = ProjectManager.create(project_manager_params)
---
INSERT INTO "project_managers" ("first_name", "last_name", "email", "password_digest", "company_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def show
        begin
            project_manager = ProjectManager.find(params[:id])
---
SELECT  "project_managers".* FROM "project_managers" WHERE "project_managers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def login
        project_manager = ProjectManager.find_by(email: project_manager_params[:email])
---
SELECT  "project_managers".* FROM "project_managers" WHERE "project_managers"."email" = $1 LIMIT $2  [["email", "matthew.97.clark@gmail.com"], ["LIMIT", 1]]