app/controllers/revision_controller.rb

    def create
        revision = Revision.new(revision_params)
        revision[:status] = 'in progress'
        revision.save
---
INSERT INTO "revisions" ("project_id", "description", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["project_id", 2], ["description", "testing modal\n"], ["status", "in progress"], ["created_at", "2020-02-20 17:47:54.849696"], ["updated_at", "2020-02-20 17:47:54.849696"]]