app/controllers/user_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "new"], ["password_digest", "$2a$12$b2Xd3/EziPd2PJl7WaF7BuZpXEC4oHzAnJnb8g0on9F2BcT/YNutS"], ["created_at", "2020-02-18 21:36:32.626224"], ["updated_at", "2020-02-18 21:36:32.626224"]]
INSERT INTO "clients" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 14], ["created_at", "2020-02-18 20:58:08.171971"], ["updated_at", "2020-02-18 20:58:08.171971"]]
INSERT INTO "project_managers" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 11], ["created_at", "2020-02-18 20:56:48.346657"], ["updated_at", "2020-02-18 20:56:48.346657"]]
---
    def create
        user = User.create(user_params)
        if user.valid?
            if params[:user][:user_type] == 'client'
                client = Client.create(user: user)
                render json: { status: "success", data: user, user_type: 'client', token: issue_token({ id: user.id  }) }, status: 201
            else
                pm = ProjectManager.create(user: user)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]
SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = $1  [["user_id", 7]]
---
    def login
        user = User.find_by(email: user_params[:email])
        if user && user.authenticate(user_params[:password])
            if user.clients.length > 0

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = $1  [["user_id", 5]]
---
    def validate
        user = get_current_user
        if user
            if user.clients.length > 0

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = $1  [["user_id", 5]]
SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = $1  [["client_id", 4]]
SELECT  "project_managers".* FROM "project_managers" WHERE "project_managers"."user_id" = $1 ORDER BY "project_managers"."id" ASC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."project_manager_id" = $1  [["project_manager_id", 2]]
---
    def projects
        user = get_current_user
        if user
            if user.clients.length > 0
                render json: { status: "success", data: user.clients.first.projects }, status: 200
            else
                render json: { status: "success", data: user.project_managers.first.projects }, status: 200